const mongoose = require("mongoose");



const TestSchema = new mongoose.Schema({



    // ======================================================
    // عنوان آزمون
    // ======================================================

    title: {

        type: String,

        required: true

    },





    // ======================================================
    // درس آزمون
    // ======================================================

    subject: {

        type: String,

        required: true

    },





    // ======================================================
    // سوالات آزمون
    // ======================================================

    questions: [


        {


            // متن سوال

            question: {

                type: String,

                required: true

            },





            // گزینه های سوال

            options: [

                String

            ],





            // جواب صحیح
            // 0 = گزینه اول
            // 1 = گزینه دوم
            // 2 = گزینه سوم
            // 3 = گزینه چهارم

            correctAnswer: {

                type: Number,

                required: true

            }



        }


    ],





    // ======================================================
    // تعداد سوالات
    // ======================================================

    questionCount: {

        type: Number,

        default: 0

    },





    // ======================================================
    // مدت زمان آزمون (دقیقه)
    // ======================================================

    duration: {

        type: Number,

        default: 30

    },





    // ======================================================
    // توصیه قبل از شروع آزمون
    // ======================================================

    advice: {

        type: String,

        default: ""

    },





    // ======================================================
    // وضعیت انتشار آزمون
    // false = فقط ادمین
    // true = نمایش برای کاربران
    // ======================================================

    isPublished: {

        type: Boolean,

        default: false

    }





},{

    // ساخت خودکار:
    // createdAt
    // updatedAt

    timestamps: true

});







module.exports = mongoose.model(

    "Test",

    TestSchema

);